import pandas as pd

# 创建两个 DataFrame
old = pd.DataFrame({'股票名称': ['广信材料', '国防ETF'],
                    '操作': ['买入', '卖出'],
                    '新比例%': ['20.0', '10.0'],
                    '时间': ['2025-03-26 13:51', '2025-03-26 10:36']})
new = pd.DataFrame({'股票名称': ['广信材料', '国防ETF', '国防ETF', '优彩资源', '国防ETF'],
                    '操作': ['买入', '卖出', '卖出', '卖出', '买入'],
                    '新比例%': ['20.0', '10.0', '0.0', '0.0', '5.0'],
                    '时间': ['2025-03-26 13:51', '2025-03-26 10:36', '2025-03-26 10:36', '2025-03-26 09:29', '2025-03-26 14:00']})

print("测试merge:")
print(old)
print(new)

new_data = new[~new.apply(tuple, axis=1).isin(old.apply(tuple, axis=1))]
print("\n新增的记录:")
print(new_data)
