<?php
// +----------------------------------------------------------------------
// | Fanwe 方维o2o商业系统
// +----------------------------------------------------------------------
// | Copyright (c) 2014 http://www.fanwe.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: 云淡风轻(97139915@qq.com)
// +----------------------------------------------------------------------

class imageModule extends MainBaseModule
{
	

	
	public function index()
	{
		
		$image=$_REQUEST['img_data'];
		echo '<img style="width:100%;" src="'.$image.'" />';
	}
	

	

	
}
?>